tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "wix/brew"
brew "aspell"
brew "autoconf"
brew "automake"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "libffi"
brew "python"
brew "glib"
brew "cmake"
brew "coreutils"
brew "llvm"
brew "cquery"
brew "cscope"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "editorconfig"
brew "fasd"
brew "fribidi"
brew "giflib"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libtiff"
brew "leptonica"
brew "sdl2"
brew "xvid"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gawk"
brew "gcc"
brew "geckodriver"
brew "git"
brew "libgcrypt"
brew "libusb"
brew "gnupg", link: false
brew "grep"
brew "helm"
brew "htop"
brew "hub"
brew "hunspell"
brew "ifstat"
brew "ilmbase"
brew "shared-mime-info"
brew "libheif"
brew "libomp"
brew "libtool"
brew "imagemagick"
brew "oniguruma"
brew "jq"
brew "libarchive"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "libzip"
brew "lnav"
brew "mas"
brew "mkcert"
brew "youtube-dl"
brew "mpv", link: false
brew "msgpack"
brew "protobuf"
brew "mysql"
brew "ncdu"
brew "neofetch", args: ["HEAD"]
brew "neovim"
brew "nmap"
brew "nnn"
brew "nspr"
brew "nss"
brew "pandoc"
brew "pinentry-mac"
brew "postgresql"
brew "prettyping"
brew "pv"
brew "ranger"
brew "rbenv"
brew "redis"
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "unixodbc"
brew "unzip"
brew "vifm"
brew "watchman"
brew "wget"
brew "zlib"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "thoughtbot/formulae/rcm"
brew "wix/brew/applesimutils"
cask "alfred"
cask "betterzip"
cask "chromedriver"
cask "day-o"
cask "docker"
cask "emacs-nightly"
cask "firefox"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "franz"
cask "gpg-suite"
cask "insomnia"
cask "iterm2-nightly"
cask "karabiner-elements"
cask "keybase"
cask "kitty"
cask "meld"
cask "mpv"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookapk"
cask "quicklookase"
cask "sequel-pro"
cask "sketch"
cask "suspicious-package"
cask "vlc"
cask "vscodium"
mas "Alfred", id: 405843582
mas "Amphetamine", id: 937984704
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Time Out", id: 402592703
mas "Xcode", id: 497799835
