tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "wix/brew"
brew "adns"
brew "aom"
brew "openssl@1.1"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "aspell"
brew "sqlite"
brew "xz"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "broot"
brew "brotli"
brew "c-ares"
brew "gettext"
brew "libffi"
brew "pcre"
brew "glib"
brew "cairo"
brew "carthage"
brew "llvm"
brew "ccls"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "swig"
brew "cquery"
brew "cscope"
brew "ctags"
brew "curl"
brew "libidn"
brew "nghttp2"
brew "openldap"
brew "curl-openssl"
brew "dav1d"
brew "diff-so-fancy"
brew "editorconfig"
brew "fasd"
brew "fd"
brew "fribidi"
brew "giflib"
brew "pkg-config"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libtiff"
brew "leptonica"
brew "libvpx"
brew "sdl2"
brew "xvid"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "freetds"
brew "fzf"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "geckodriver"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "gnupg", link: false
brew "grep"
brew "helm"
brew "highlight"
brew "ncurses"
brew "htop"
brew "httpd", restart_service: true
brew "hub"
brew "hunspell"
brew "ifstat"
brew "ilmbase"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "libomp"
brew "imagemagick"
brew "imlib2"
brew "ios-deploy"
brew "jmeter"
brew "oniguruma"
brew "jq"
brew "krb5"
brew "lazydocker"
brew "lazygit"
brew "lz4"
brew "libarchive"
brew "libimobiledevice"
brew "libpq"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "libzip"
brew "lnav"
brew "lynx"
brew "mas"
brew "mercurial"
brew "mkcert"
brew "mujs"
brew "uchardet"
brew "zimg"
brew "vapoursynth"
brew "youtube-dl"
brew "mpv", link: false
brew "msgpack"
brew "protobuf"
brew "mysql", restart_service: true
brew "ncdu"
brew "neofetch", args: ["HEAD"]
brew "neovim"
brew "nmap"
brew "nnn"
brew "nspr"
brew "nss"
brew "pandoc"
brew "php", restart_service: true
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew "prettyping"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "shellcheck"
brew "sl"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "toilet"
brew "trash"
brew "tree"
brew "unzip"
brew "vifm"
brew "watchman"
brew "wget"
brew "zlib"
brew "aws/tap/aws-sam-cli"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "thoughtbot/formulae/rcm"
brew "wix/brew/applesimutils"
cask "alacritty"
cask "alfred"
cask "betterzip"
cask "calibre"
cask "chromedriver"
cask "detox-instruments"
cask "docker"
cask "emacs"
cask "firefox"
cask "font-cantarell"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "franz"
cask "google-chrome"
cask "gpg-suite"
cask "insomnia"
cask "iterm2-nightly"
cask "karabiner-elements"
cask "keepassxc"
cask "keybase"
cask "kitty"
cask "meld"
cask "mpv"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookapk"
cask "quicklookase"
cask "react-native-debugger"
cask "rectangle"
cask "sequel-pro"
cask "sketch"
cask "slack"
cask "stretchly"
cask "suspicious-package"
cask "syncthing"
cask "synergy"
cask "vagrant"
cask "vlc"
cask "vscodium"
cask "witch"
cask "xquartz"
mas "Alfred", id: 405843582
mas "Amphetamine", id: 937984704
mas "Clocker", id: 1056643111
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Meeter", id: 1510445899
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
