tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
brew "aspell"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "libffi"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "glib"
brew "openssl"
brew "cmake"
brew "coreutils"
brew "llvm"
brew "cquery"
brew "cscope"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "editorconfig"
brew "fasd"
brew "fribidi"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "sdl2"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gawk"
brew "geckodriver"
brew "git"
brew "libgcrypt"
brew "libusb"
brew "gnupg"
brew "grep"
brew "htop"
brew "hub"
brew "hunspell"
brew "ifstat"
brew "shared-mime-info"
brew "libheif"
brew "libomp"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "kubernetes-helm"
brew "libarchive"
brew "libvterm"
brew "libxslt"
brew "libyaml"
brew "lnav"
brew "mas"
brew "mkcert"
brew "youtube-dl"
brew "mpv"
brew "mysql", restart_service: true
brew "ncdu"
brew "neofetch", args: ["HEAD"]
brew "neovim"
brew "nmap"
brew "nnn"
brew "nss"
brew "postgresql", restart_service: true
brew "prettyping"
brew "ranger"
brew "redis", restart_service: true
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "unzip"
brew "vifm"
brew "watchman"
brew "wget"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "thoughtbot/formulae/rcm"
cask "alfred"
cask "chromedriver"
cask "day-o"
cask "docker"
cask "firefox"
cask "gpg-suite"
cask "keybase"
cask "kitty"
cask "meld"
cask "mpv"
cask "sequel-pro"
cask "sketch"
cask "vlc"
cask "caskroom/fonts/font-iosevka"
cask "caskroom/fonts/font-iosevka-nerd-font"
cask "caskroom/versions/iterm2-nightly"
mas "Amphetamine", id: 937984704
mas "Drafts", id: 1435957248
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monosnap", id: 540348655
mas "Newton", id: 1059655371
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Time Out", id: 402592703
mas "Xcode", id: 497799835
